OOAD lec113 Future Object Methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 09:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Future Object API</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">Future Object API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4606ab">1. How to combine different Futures</a>
<ul>
<li><a href="#org9504557">1.1. <code>firstCompletedOf()()</code></a></li>
<li><a href="#org66a678f">1.2. <code>sequence()()</code></a></li>
<li><a href="#orgece6758">1.3. Same and Different</a></li>
</ul>
</li>
<li><a href="#orgb43b841">2. Code Snippet</a></li>
</ul>
</div>
</div>


<div id="orgc4606ab" class="outline-2">
<h2 id="orgc4606ab"><span class="section-number-2">1</span> How to combine different Futures</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="org9504557" class="outline-3">
<h3 id="org9504557"><span class="section-number-3">1.1</span> <code>firstCompletedOf()()</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-scala">firstCompletedOf[<span style="color: #a45bad;">T</span>](futures<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">TraversableOnce</span>[<span style="color: #a45bad;">Future</span>[<span style="color: #a45bad;">T</span>]])
                (<span style="color: #4f97d7;">implicit</span> excutor<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">ExecutionContext</span>)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Future</span>[<span style="color: #a45bad;">R</span>]

</pre>
</div>

<p>
Argument of the <code>firstCompletedOf()()</code> method is <code>TraversableOnce</code> of
Futures &#x2014; any collection of Futures on some type T, and it will give back
the <b>Future completed first</b> upon all Futures in this collection.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">pages</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">List</span>(page1,page2,page3)
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">firstPage</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span>.firstCompletedOf(pages)
firstPage.foreach(println)
</pre>
</div>

<ul class="org-ul">
<li>[Q] but why would you want to create a whole bunch of Futures and only
deal with the one that completes first ?</li>
<li>[A] the answer to that is in applications where for example you’re
<b>getting information from multiple sources and you only need to get it
from one to complete your task</b>, maybe you’re writing a website that is
supposed to display is weather information, and you have 3 or 4 source you
can get the weather information from, but you only need it from one of
them. so you hit 3 or 4 of them and then you take the one that finished
first.</li>
</ul>
</div>
</div>

<div id="org66a678f" class="outline-3">
<h3 id="org66a678f"><span class="section-number-3">1.2</span> <code>sequence()()</code></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-scala">sequence[<span style="color: #a45bad;">A</span>, <span style="color: #a45bad;">M</span>[<span style="color: #a45bad;">X</span>] <span style="color: #4f97d7; font-weight: bold;">&lt;:</span> <span style="color: #a45bad;">Traversable</span>[<span style="color: #a45bad;">X</span>]](in<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">M</span>[<span style="color: #a45bad;">Future</span>[<span style="color: #a45bad;">A</span>]])(<span style="color: #4f97d7;">implicit</span> cbf<span style="color: #4f97d7; font-weight: bold;">:</span><span style="color: #ce537a; font-weight: bold;">CanBuildFrom</span>[<span style="color: #a45bad;">M</span>[<span style="color: #a45bad;">Future</span>[<span style="color: #a45bad;">A</span>]], <span style="color: #a45bad;">A</span>, <span style="color: #a45bad;">M</span>[<span style="color: #a45bad;">A</span>]], executor<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">ExecutionContext</span>)<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Future</span>[<span style="color: #a45bad;">M</span>[<span style="color: #a45bad;">A</span>]]
</pre>
</div>

<p>
you give a Traversable of Futures, and it gives you back a Future of the
Traversable. I had a different Futures that were all inside of some
colletion and it will allow me to convert from that collection of Futures of
some type to a Future of a collection. It is more likely to be the inverse
of the firstCompletedOf method.
</p>

<p>
使用 sequence 时一定要注意，这个 collection of Futures 中的所有 Future 必须确保可以完成，比如这里其中一个网址是 google 在国内访问不了，所以整体
sequence 一直没有返回。
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">pages</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">List</span>(page1,page2,page3)
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">allPages</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span>.sequence(pages)
allPages.foreach(println)
</pre>
</div>
</div>
</div>

<div id="orgece6758" class="outline-3">
<h3 id="orgece6758"><span class="section-number-3">1.3</span> Same and Different</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">different</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">- firstCompletedOf() tells which one finishes first</td>
</tr>

<tr>
<td class="org-left">- sequence() wait for them all to complete</td>
</tr>

<tr>
<td class="org-left">- firstCompletedOf: collection of Futures =&gt; one Future</td>
</tr>

<tr>
<td class="org-left">- sequence: collection of Futures =&gt; Future of collection</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>same</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">- they’re helpful when you’re retrieving information from other places</td>
</tr>

<tr>
<td class="org-left">- they're both Non-Blocking call</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="orgb43b841" class="outline-2">
<h2 id="orgb43b841"><span class="section-number-2">2</span> Code Snippet</h2>
<div class="outline-text-2" id="text-2">
<p>
get the first 100 chars of three website:
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">page1</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span> {
  <span style="color: #2d9574;">"Google "</span> + io.<span style="color: #a45bad;">Source</span>.fromURL(<span style="color: #2d9574;">"http://www.google.com"</span>).take(<span style="color: #a45bad;">100</span>).mkString
}
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">page2</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span> {
  <span style="color: #2d9574;">"Baidu "</span> + io.<span style="color: #a45bad;">Source</span>.fromURL(<span style="color: #2d9574;">"http://www.baidu.com"</span>).take(<span style="color: #a45bad;">100</span>).mkString
}
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">page3</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span> {
  <span style="color: #2d9574;">"Sina "</span> + io.<span style="color: #a45bad;">Source</span>.fromURL(<span style="color: #2d9574;">"http://www.sina.com"</span>).take(<span style="color: #a45bad;">100</span>).mkString
}

<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">pages</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">List</span>(page1,page2,page3)

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22240;&#20026;&#20320;&#20063;&#19981;&#30693;&#36947;&#21738;&#20010; Future &#20250;&#20808;&#33719;&#24471;&#20540;</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25152;&#20197;&#36825;&#20010; firstCompletedOf &#23601;&#26174;&#24471;&#38750;&#24120;&#26377;&#29992;&#20102;</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">firstPage</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span>.firstCompletedOf(pages)
firstPage.foreach(println)

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">what if I want all of 3 pages</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">'allPages' is a Future of collection</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25152;&#26377; Future &#24517;&#39035;&#12304;&#30830;&#20445;&#21487;&#20197;&#23436;&#25104;&#12305;&#65292;&#27604;&#22914;&#36825;&#37324;&#20854;&#20013;&#19968;&#20010;&#32593;&#22336;&#26159; google</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#22269;&#20869;&#35775;&#38382;&#19981;&#20102;&#65292;&#25152;&#20197;&#25972;&#20307; sequence &#19968;&#30452;&#27809;&#26377;&#36820;&#22238;&#12290;</span>
<span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">allPages</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Future</span>.sequence(pages)

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#21516;&#26679;&#30340;&#21487;&#20197;&#36890;&#36807; sequence &#20989;&#25968;&#26469;&#33719;&#21462;&#19968;&#20010; Future of a collection</span>
allPages.foreach(println)

<span style="color: #a45bad;">Thread</span>.sleep(<span style="color: #a45bad;">5000</span>)

</pre>
</div>
</div>
</div>
</div>
</body>
</html>
